# VectorTextType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayVectorSettings..::..VectorTextType Property
AnalysisDisplayVectorSettings Class See Also
---
Type of vector text visualization.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public AnalysisDisplayStyleVectorTextType VectorTextType { get; set; }
```

Visual Basic
---
```text
Public Property VectorTextType As AnalysisDisplayStyleVectorTextType
	Get
	Set
```

Visual C++
---
```text
public:
property AnalysisDisplayStyleVectorTextType VectorTextType {
	AnalysisDisplayStyleVectorTextType get ();
	void set (AnalysisDisplayStyleVectorTextType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace